
"Translator" = "Translator";
"Failed to open file" = "Failed to open file";
"Failed to read file" = "Failed to read file";
"Set storage directory" = "Set storage directory";
"Please set the storage directory first" = "Please set the storage directory first";
"Choose to fail" = "Choose to fail";
"Please select the .csv file first" = "Please select the .csv file first";
"Select the .csv file" = "Select the .csv file";
"Select storage directory" = "Select storage directory";
"Stored in this directory" = "Stored in this directory";
"Choose" = "Choose";
"lproj folder creation failed" = ".lproj folder creation failed";
"completed" = "completed";
"Parsing failed, please check the .csv file format" = "Parsing failed, please check the .csv file format";
"Cancel" = "Cancel";
"Created successfully" = "Created successfully";
"Creation failed" = "Creation failed";
"File Path" = "File Path";
"Write failed" = "Write failed";
"Done" = "Done";
"App Desc" = "Translator can help you quickly convert the contents of the `.csv` table into the .lproj file of the corresponding country in the iOS project. The following are the steps to use: \n• Multi-language annotation (optional): used before each multi-language Add comments;\n• First set the storage directory;\n• Then select the .csv file. The file format must be consistent with the format generated in the lower right corner;\n• Finally, click to start parsing. \n\nAutomatic operation\n1. Automatically replace %s with %@;\n2. Automatically escape English quotes, that is: \"convert\\\";\n3. Automatically process %@{} full Angle as half Angle";
"Start parsing" = "Start parsing";
"Open" = "Open";
